DataProcessors/бит_АРМКассира.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_АРМКассира</Name>
			<Comment>Автоматизированное рабочее место Кассира</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновлятьИтогАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаКУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьИтог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияКасс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияКасс</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонИзвещений</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/бит_ВидыОперацийЧекККМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийЧекККМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаВнешнийБиллинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратВнешнийБиллинг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_ВидыОперацийОплатыКУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийОплатыКУ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗакрытиеКассовойСмены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеОплаты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/бит_бу_ОплатаБиллинговыхУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_бу_ОплатаБиллинговыхУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.бит_бу_НачисленияБиллинговыхУслуг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводВРучную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_КассыККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлиентБанк</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлDBF</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЛС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СальдоНаЛС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧекККМ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_ЧекККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонИзвещений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонИзвещений</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/бит_АРМКассира/Ext/ObjectModule.bsl
#Область ПеременныеМодуля

Перем мОтветсвенный Экспорт; // Хранит отвественное лицо.

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура разбивает по датам оплату коммунальных услуг.
//
Процедура РазбитьОплатаКУПоДатам(Отказ = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	
	МассивВидовОпераций   = Новый Массив;
	МассивВидовОпераций.Добавить(Перечисления.бит_ВидыОперацийЧекККМ.Продажа);
	МассивВидовОпераций.Добавить(Перечисления.бит_ВидыОперацийЧекККМ.Возврат);
	
	МассивВидовОперацийБУ = Новый Массив;
	МассивВидовОперацийБУ.Добавить(Перечисления.бит_ВидыОперацийЧекККМ.ПродажаВнешнийБиллинг);
	МассивВидовОперацийБУ.Добавить(Перечисления.бит_ВидыОперацийЧекККМ.ВозвратВнешнийБиллинг);
	
	ТаблицаЧеков    = ПолучитьТаблицуЧеков(МассивВидовОпераций);
	КоличествоЧеков = ТаблицаЧеков.Количество();
	
	ТаблицаЧековБУ    = ПолучитьТаблицуЧеков(МассивВидовОперацийБУ);
	КоличествоЧековБУ = ТаблицаЧековБУ.Количество();
	
	Если КоличествоЧеков = 0 И КоличествоЧековБУ = 0 Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Чеков не найдено";
		Сообщение.Сообщить();
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 
	
	ТаблицаЧеков.Сортировать("Дата Возр");
	ТаблицаЧековБУ.Сортировать("Дата Возр");
	
	СписокЧеков = Новый СписокЗначений;
	СписокЧеков.ЗагрузитьЗначения(ТаблицаЧеков.ВыгрузитьКолонку("Чек"));
	
	СписокЧековБУ = Новый СписокЗначений;
	СписокЧековБУ.ЗагрузитьЗначения(ТаблицаЧековБУ.ВыгрузитьКолонку("Чек"));
	
	Запрос.УстановитьПараметр("Касса", Касса);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачисленияКасс.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияКасс.Услуга,
	|	бит_НачисленияКасс.ШаблонИзвещений КАК ШаблонИзвещений,
	|	СУММА(бит_НачисленияКасс.СуммаОплаты) КАК Сумма,
	|	СУММА(бит_НачисленияКасс.СуммаПени) КАК СуммаПени,
	|	НАЧАЛОПЕРИОДА(бит_НачисленияКасс.Период, ДЕНЬ) КАК Дата,
	|	бит_НачисленияКасс.Период КАК Период,
	|	бит_НачисленияКасс.КассаККМ КАК КассаККМ
	|ИЗ
	|	РегистрНакопления.бит_НачисленияКасс КАК бит_НачисленияКасс
	|ГДЕ
	|	бит_НачисленияКасс.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И бит_НачисленияКасс.КассаККМ = &Касса
	|	И бит_НачисленияКасс.Регистратор В(&СписокЧеков)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияКасс.ЛицевойСчет,
	|	бит_НачисленияКасс.Период,
	|	бит_НачисленияКасс.Услуга,
	|	бит_НачисленияКасс.КассаККМ,
	|	бит_НачисленияКасс.ШаблонИзвещений,
	|	НАЧАЛОПЕРИОДА(бит_НачисленияКасс.Период, ДЕНЬ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаПени),
	|	МАКСИМУМ(Период)
	|ПО
	|	Дата,
	|	КассаККМ,
	|	ЛицевойСчет,
	|	ШаблонИзвещений";
	
	НачатьТранзакцию();
	
	// Создание оплаты коммунальных услуг.
	Если КоличествоЧеков > 0 Тогда
		
		НачалоПериода = ТаблицаЧеков[0].Дата;
		КонецПериода  = ТаблицаЧеков[КоличествоЧеков - 1].Дата;
		
		Запрос.УстановитьПараметр("НачалоПериода" , НачалоДня(НачалоПериода));
		Запрос.УстановитьПараметр("КонецПериода"  , КонецДня(КонецПериода));
		Запрос.УстановитьПараметр("СписокЧеков"   , СписокЧеков);
		
		ВыборкаДаты = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаДаты.Следующий() Цикл
			
			ДатаОплаты = ВыборкаДаты.Дата;
			
			ВыборкаКасса = ВыборкаДаты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаКасса.Следующий() Цикл
				
				НоваяОплата = Документы.бит_ОплатаКУ.СоздатьДокумент();
				НоваяОплата.Дата = ВыборкаДаты.Период;
				НоваяОплата.ВидОперации    = Перечисления.бит_ВидыОперацийОплатыКУ.ЗакрытиеКассовойСмены;
				НоваяОплата.Ответственный  = мОтветсвенный;
				НоваяОплата.ИсточникОплаты = ВыборкаКасса.КассаККМ;
				НоваяОплата.Организация    = ВыборкаКасса.КассаККМ.Владелец;
				НоваяОплата.Комментарий    = "Создано с помощью обработки создания оплат ку.";
				
				СуммаДокумента = 0;
				
				ВыборкаЛС = ВыборкаКасса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаЛС.Следующий() Цикл
					
					ВыборкаШАблон = ВыборкаЛС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаШАблон.Следующий() Цикл
						
						Если ВыборкаШАблон.Сумма <= 0 И ВыборкаШАблон.СуммаПени <=0 Тогда
							Продолжить;
						КонецЕсли; 
						
						СтрокаЛС = НоваяОплата.СписокЛС.Добавить();
						
						СтрокаЛС.ЛицевойСчет     = ВыборкаШАблон.ЛицевойСчет;
						СтрокаЛС.ШаблонИзвещений = ВыборкаШАблон.ШаблонИзвещений;
						
						СтрокаЛС.Сумма           = ВыборкаШАблон.Сумма + ВыборкаШАблон.СуммаПени;
						
						СуммаДокумента           = СуммаДокумента + СтрокаЛС.Сумма;
						
						
						ВыборкаУС = ВыборкаШАблон.Выбрать();
						
						Пока ВыборкаУС.Следующий() Цикл
							
							СтрокаУС = НоваяОплата.СписокУслуг.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаУС, ВыборкаУС);
							
						КонецЦикла;  
					КонецЦикла;
				КонецЦикла;
				
				НоваяОплата.СуммаДокумента = СуммаДокумента;
				НоваяОплата.ЗапролнитьСчета();
				
				Если НЕ бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(НоваяОплата, РежимЗаписиДокумента.Запись,,"Ошибки") Тогда
					
					ОтменитьТранзакцию();
					Отказ = Истина;
					Возврат;
					
				Иначе
					
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Создан документ " + НоваяОплата;
					Сообщение.Сообщить();
					
				КонецЕсли;
				
				Отбор = Новый Структура;
				Отбор.Вставить("ДатаОплаты", ДатаОплаты);
				
				ЧекиККМ = ТаблицаЧеков.НайтиСтроки(Отбор); 
				
				Для каждого Строка Из ЧекиККМ Цикл
					
					Чек = Строка.Чек.ПолучитьОбъект();
					Чек.Архивный = Истина;
					Чек.ОплатаКУ = НоваяОплата.Ссылка; 
					
					Если НЕ бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(Чек, РежимЗаписиДокумента.Запись,,"Ошибки") Тогда
						
						ОтменитьТранзакцию();
						Отказ = Истина;
						Возврат;
						
					Иначе
						
						Сообщение = Новый СообщениеПользователю();
						Сообщение.Текст = "Записан документ " + Чек;
						Сообщение.Сообщить();
						
					КонецЕсли;
					
				КонецЦикла; 
				
				Если НЕ бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(НоваяОплата, РежимЗаписиДокумента.Проведение,,"Ошибки") Тогда
					
					ОтменитьТранзакцию();
					Отказ = Истина;
					Возврат;
					
				Иначе
					
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Проведен документ " + НоваяОплата;
					Сообщение.Сообщить();
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;

	// Создание оплаты биллинговых услуг.
	Если КоличествоЧековБУ > 0 Тогда
		
		НачалоПериодаБУ = ТаблицаЧековБУ[0].Дата;
		КонецПериодаБУ  = ТаблицаЧековБУ[КоличествоЧековБУ - 1].Дата;
		
		Запрос.УстановитьПараметр("НачалоПериода" , НачалоДня(НачалоПериодаБУ));
		Запрос.УстановитьПараметр("КонецПериода"  , КонецДня(КонецПериодаБУ));
		Запрос.УстановитьПараметр("СписокЧеков"   , СписокЧековБУ);
		
		ВыборкаДаты = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаДаты.Следующий() Цикл
			
			ДатаОплаты = ВыборкаДаты.Дата;
			
			ВыборкаКасса = ВыборкаДаты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаКасса.Следующий() Цикл
				
				НоваяОплата = Документы.бит_бу_ОплатаБиллинговыхУслуг.СоздатьДокумент();
				НоваяОплата.Дата           = ВыборкаДаты.Период;
				НоваяОплата.Ответственный  = мОтветсвенный;
				НоваяОплата.ИсточникОплаты = ВыборкаКасса.КассаККМ;
				НоваяОплата.Организация    = ВыборкаКасса.КассаККМ.Владелец;
				НоваяОплата.Комментарий    = "Создано с помощью обработки АРМ кассира.";
				
				СуммаДокумента = 0;
				
				ВыборкаЛС = ВыборкаКасса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаЛС.Следующий() Цикл
					
					ВыборкаШАблон = ВыборкаЛС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаШАблон.Следующий() Цикл
						
						Если ВыборкаШАблон.Сумма <= 0 Тогда
							
							Продолжить;
							
						КонецЕсли; 
						
						СтрокаЛС = НоваяОплата.СписокЛС.Добавить();
						
						СтрокаЛС.ЛицевойСчет     = ВыборкаШАблон.ЛицевойСчет;
						СтрокаЛС.ШаблонИзвещений = ВыборкаШАблон.ШаблонИзвещений;
						
						СтрокаЛС.Сумма           = ВыборкаШАблон.Сумма + ВыборкаШАблон.СуммаПени;
						
						СуммаДокумента           = СуммаДокумента + СтрокаЛС.Сумма;
						
						
						ВыборкаУС = ВыборкаШАблон.Выбрать();
						
						Пока ВыборкаУС.Следующий() Цикл
							
							СтрокаУС = НоваяОплата.СписокУслуг.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаУС, ВыборкаУС);
							
						КонецЦикла;  
					КонецЦикла;
				КонецЦикла;
				
				НоваяОплата.СуммаДокумента = СуммаДокумента;
				НоваяОплата.ЗапролнитьСчета();
				
				Если НЕ бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(НоваяОплата, РежимЗаписиДокумента.Проведение,,"Ошибки") Тогда
					
					ОтменитьТранзакцию();
					Отказ = Истина;
					Возврат;
					
				Иначе
					
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Проведен документ " + НоваяОплата;
					Сообщение.Сообщить();
					
				КонецЕсли;
				
				СоздатьНачислениеБиллинговыхУслуг(НоваяОплата.Ссылка, Отказ);
				
				Если Отказ Тогда
					
					ОтменитьТранзакцию();
					Возврат;
					
				КонецЕсли; 
				
				Отбор = Новый Структура;
				Отбор.Вставить("ДатаОплаты", ДатаОплаты);
				
				ЧекиККМ = ТаблицаЧековБУ.НайтиСтроки(Отбор); 
				
				Для каждого Строка Из ЧекиККМ Цикл
					
					Чек = Строка.Чек.ПолучитьОбъект();
					Чек.Архивный = Истина;
					Чек.ОплатаКУ = НоваяОплата.Ссылка; 
					
					Если НЕ бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(Чек, РежимЗаписиДокумента.Запись,,"Ошибки") Тогда
						
						ОтменитьТранзакцию();
						Отказ = Истина;
						Возврат;
						
					Иначе
						
						Сообщение = Новый СообщениеПользователю();
						Сообщение.Текст = "Записан документ " + Чек;
						Сообщение.Сообщить();
						
					КонецЕсли;
					
				КонецЦикла; 
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли; 
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

// Процедура создания оплаты КУ.
//
Процедура СоздатьОплатаКУ(Отказ = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	
	МассивВидовОпераций   = Новый Массив;
	МассивВидовОпераций.Добавить(Перечисления.бит_ВидыОперацийЧекККМ.Продажа);
	МассивВидовОпераций.Добавить(Перечисления.бит_ВидыОперацийЧекККМ.Возврат);
	
	МассивВидовОперацийБУ = Новый Массив;
	МассивВидовОперацийБУ.Добавить(Перечисления.бит_ВидыОперацийЧекККМ.ПродажаВнешнийБиллинг);
	МассивВидовОперацийБУ.Добавить(Перечисления.бит_ВидыОперацийЧекККМ.ВозвратВнешнийБиллинг);
	
	ТаблицаЧеков    = ПолучитьТаблицуЧеков(МассивВидовОпераций);
	КоличествоЧеков = ТаблицаЧеков.Количество();
	
	ТаблицаЧековБУ    = ПолучитьТаблицуЧеков(МассивВидовОперацийБУ);
	КоличествоЧековБУ = ТаблицаЧековБУ.Количество();
	
	Если КоличествоЧеков = 0 И КоличествоЧековБУ = 0 Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "По кассе не найдено чеков.";
		Сообщение.Сообщить();
		
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 
	
	ТаблицаЧеков.Сортировать("Дата Возр");
	ТаблицаЧековБУ.Сортировать("Дата Возр");
	
	СписокЧеков = Новый СписокЗначений;
	СписокЧеков.ЗагрузитьЗначения(ТаблицаЧеков.ВыгрузитьКолонку("Чек"));
	
	СписокЧековБУ = Новый СписокЗначений;
	СписокЧековБУ.ЗагрузитьЗначения(ТаблицаЧековБУ.ВыгрузитьКолонку("Чек"));
	
	Запрос.УстановитьПараметр("Касса", Касса);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачисленияКасс.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияКасс.Услуга,
	|	бит_НачисленияКасс.ШаблонИзвещений КАК ШаблонИзвещений,
	|	СУММА(бит_НачисленияКасс.СуммаОплаты) КАК Сумма,
	|	СУММА(бит_НачисленияКасс.СуммаПени) КАК СуммаПени
	|ИЗ
	|	РегистрНакопления.бит_НачисленияКасс КАК бит_НачисленияКасс
	|ГДЕ
	|	бит_НачисленияКасс.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И бит_НачисленияКасс.КассаККМ = &Касса
	|	И бит_НачисленияКасс.Регистратор В(&СписокЧеков)
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияКасс.ЛицевойСчет,
	|	бит_НачисленияКасс.Услуга,
	|	бит_НачисленияКасс.ШаблонИзвещений
	|ИТОГИ
	|	СУММА(Сумма),
	|	СУММА(СуммаПени)
	|ПО
	|	ЛицевойСчет,
	|	ШаблонИзвещений";
	
	НачатьТранзакцию();
	
	// Создание оплаты коммунальных услуг.
	Если КоличествоЧеков > 0 Тогда
		
		НачалоПериода = ТаблицаЧеков[0].Дата;
		КонецПериода  = ТаблицаЧеков[КоличествоЧеков - 1].Дата;
		
		Запрос.УстановитьПараметр("НачалоПериода" , НачалоДня(НачалоПериода));
		Запрос.УстановитьПараметр("КонецПериода"  , КонецДня(КонецПериода));
		Запрос.УстановитьПараметр("СписокЧеков"   , СписокЧеков);
		
		НоваяОплата = Документы.бит_ОплатаКУ.СоздатьДокумент();
		НоваяОплата.Дата = ТекущаяДата();
		НоваяОплата.ВидОперации    = Перечисления.бит_ВидыОперацийОплатыКУ.ЗакрытиеКассовойСмены;
		НоваяОплата.Ответственный  = мОтветсвенный;
		НоваяОплата.ИсточникОплаты = Касса;
		НоваяОплата.Организация    = Касса.Владелец;
		НоваяОплата.Комментарий    = "Документ создан из обработки АРМ Кассира.";
		СуммаДокумента = 0;
		
		ВыборкаЛС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЛС.Следующий() Цикл
			
			ВыборкаШАблон = ВыборкаЛС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаШАблон.Следующий() Цикл
				
				Если ВыборкаШАблон.Сумма <= 0 И ВыборкаШАблон.СуммаПени <=0 Тогда
					Продолжить;
				КонецЕсли; 
				
				СтрокаЛС = НоваяОплата.СписокЛС.Добавить();
				
				СтрокаЛС.ЛицевойСчет     = ВыборкаШАблон.ЛицевойСчет;
				СтрокаЛС.ШаблонИзвещений = ВыборкаШАблон.ШаблонИзвещений;
				
				СтрокаЛС.Сумма           = ВыборкаШАблон.Сумма + ВыборкаШАблон.СуммаПени;
				
				СуммаДокумента           = СуммаДокумента + СтрокаЛС.Сумма;
				
				
				ВыборкаУС = ВыборкаШАблон.Выбрать();
				
				Пока ВыборкаУС.Следующий() Цикл
					
					СтрокаУС = НоваяОплата.СписокУслуг.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаУС, ВыборкаУС);
					
				КонецЦикла;  
			КонецЦикла;
		КонецЦикла;
		
		НоваяОплата.СуммаДокумента = СуммаДокумента;
		НоваяОплата.ЗапролнитьСчета();
		
		Если НЕ бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(НоваяОплата, РежимЗаписиДокумента.Запись,,"Ошибки") Тогда
			
			ОтменитьТранзакцию();
			Отказ = Истина;
			Возврат;
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Создан документ " + НоваяОплата;
			Сообщение.Сообщить();
			
		КонецЕсли;
		
		Для каждого Строка Из ТаблицаЧеков Цикл
			
			Чек = Строка.Чек.ПолучитьОбъект();
			Чек.Архивный = Истина;
			Чек.ОплатаКУ = НоваяОплата.Ссылка; 
			
			
			Если НЕ бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(Чек, РежимЗаписиДокумента.Запись,,"Ошибки") Тогда
				
				ОтменитьТранзакцию();
				Отказ = Истина;
				Возврат;
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Записан документ " + Чек;
				Сообщение.Сообщить();
				
			КонецЕсли;
			
		КонецЦикла; 
		
		Если НЕ бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(НоваяОплата, РежимЗаписиДокумента.Проведение,,"Ошибки") Тогда
			
			ОтменитьТранзакцию();
			Отказ = Истина;
			Возврат;
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Проведен документ " + НоваяОплата;
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Создание оплаты биллинговых услуг.
	Если КоличествоЧековБУ > 0 Тогда
		
		НачалоПериодаБУ = ТаблицаЧековБУ[0].Дата;
		КонецПериодаБУ  = ТаблицаЧековБУ[КоличествоЧековБУ - 1].Дата;
		
		Запрос.УстановитьПараметр("НачалоПериода" , НачалоДня(НачалоПериодаБУ));
		Запрос.УстановитьПараметр("КонецПериода"  , КонецДня(КонецПериодаБУ));
		Запрос.УстановитьПараметр("СписокЧеков"   , СписокЧековБУ);
		
		НоваяОплата = Документы.бит_бу_ОплатаБиллинговыхУслуг.СоздатьДокумент();
		НоваяОплата.Дата = ТекущаяДата();
		НоваяОплата.Ответственный  = мОтветсвенный;
		НоваяОплата.ИсточникОплаты = Касса;
		НоваяОплата.Организация    = Касса.Владелец;
		НоваяОплата.Комментарий    = "Документ создан из обработки АРМ Кассира.";
		СуммаДокумента = 0;
		
		ВыборкаЛС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаЛС.Следующий() Цикл
			
			ВыборкаШАблон = ВыборкаЛС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаШАблон.Следующий() Цикл
				
				Если ВыборкаШАблон.Сумма <= 0 Тогда
					
					Продолжить;
					
				КонецЕсли; 
				
				СтрокаЛС = НоваяОплата.СписокЛС.Добавить();
				
				СтрокаЛС.ЛицевойСчет     = ВыборкаШАблон.ЛицевойСчет;
				СтрокаЛС.ШаблонИзвещений = ВыборкаШАблон.ШаблонИзвещений;
				
				СтрокаЛС.Сумма           = ВыборкаШАблон.Сумма + ВыборкаШАблон.СуммаПени;
				
				СуммаДокумента           = СуммаДокумента + СтрокаЛС.Сумма;
				
				
				ВыборкаУС = ВыборкаШАблон.Выбрать();
				
				Пока ВыборкаУС.Следующий() Цикл
					
					СтрокаУС = НоваяОплата.СписокУслуг.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаУС, ВыборкаУС);
					
				КонецЦикла;  
			КонецЦикла;
		КонецЦикла;
		
		НоваяОплата.СуммаДокумента = СуммаДокумента;
		НоваяОплата.ЗапролнитьСчета();
		
		Если НоваяОплата.СписокЛС.Количество() > 0 Тогда
			
			Если НЕ бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(НоваяОплата, РежимЗаписиДокумента.Проведение,,"Ошибки") Тогда
				
				ОтменитьТранзакцию();
				Отказ = Истина;
				Возврат;
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Проведен документ " + НоваяОплата;
				Сообщение.Сообщить();
				
			КонецЕсли;
			
			СоздатьНачислениеБиллинговыхУслуг(НоваяОплата.Ссылка, Отказ);
			
			Если Отказ Тогда
				
				ОтменитьТранзакцию();
				Возврат;
				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Для каждого Строка Из ТаблицаЧековБУ Цикл
			
			Чек = Строка.Чек.ПолучитьОбъект();
			Чек.Архивный = Истина;
			Чек.ОплатаКУ = НоваяОплата.Ссылка; 
			
			
			Если НЕ бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(Чек, РежимЗаписиДокумента.Запись,,"Ошибки") Тогда
				
				ОтменитьТранзакцию();
				Отказ = Истина;
				Возврат;
				
			Иначе
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Записан документ " + Чек;
				Сообщение.Сообщить();
				
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

// Процедура создает начисление биллинговых услуг.
//
Процедура СоздатьНачислениеБиллинговыхУслуг(СсылкаНаОплату, Отказ)
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаОплату) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_бу_ОплатаБиллинговыхУслугСписокУслуг.ЛицевойСчет,
	|	бит_бу_ОплатаБиллинговыхУслугСписокУслуг.Услуга,
	|	СУММА(бит_бу_ОплатаБиллинговыхУслугСписокУслуг.Сумма) КАК Сумма,
	|	бит_бу_ОплатаБиллинговыхУслугСписокУслуг.Приоритет КАК Приоритет,
	|	бит_бу_ОплатаБиллинговыхУслугСписокУслуг.ЛицевойСчет.Здание КАК Здание,
	|	бит_бу_ОплатаБиллинговыхУслугСписокУслуг.ЛицевойСчет.Наименование КАК Наименование
	|ИЗ
	|	Документ.бит_бу_ОплатаБиллинговыхУслуг.СписокУслуг КАК бит_бу_ОплатаБиллинговыхУслугСписокУслуг
	|ГДЕ
	|	бит_бу_ОплатаБиллинговыхУслугСписокУслуг.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_бу_ОплатаБиллинговыхУслугСписокУслуг.Услуга,
	|	бит_бу_ОплатаБиллинговыхУслугСписокУслуг.ЛицевойСчет,
	|	бит_бу_ОплатаБиллинговыхУслугСписокУслуг.ЛицевойСчет.Здание,
	|	бит_бу_ОплатаБиллинговыхУслугСписокУслуг.Приоритет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование,
	|	Приоритет
	|ИТОГИ ПО
	|	Здание";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОплату);
	
	ВыборкаЗдание = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗдание.Следующий() Цикл
		
		НовыйДокумент = Документы.бит_бу_НачисленияПоБиллинговымУслугам.СоздатьДокумент();
		
		НовыйДокумент.Дата          = СсылкаНаОплату.Дата -1;
		НовыйДокумент.Организация   = СсылкаНаОплату.Организация;
		НовыйДокумент.Улица         = ВыборкаЗдание.Здание.Улица;
		НовыйДокумент.Здание        = ВыборкаЗдание.Здание;
		НовыйДокумент.Ответственный = мОтветсвенный;
		НовыйДокумент.Комментарий   = "Создано с помощью обработки АРМ кассира.";
		
		Выборка = ВыборкаЗдание.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НоваяСтрока = НовыйДокумент.ЛицевыеСчета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
			
		КонецЦикла; 
		
		НовыйДокумент.ЗапролнитьСчета();
		
		Если НЕ бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(НовыйДокумент, РежимЗаписиДокумента.Проведение,,"Ошибки") Тогда
			
			Отказ = Истина;	
			
		Иначе
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Проведен документ " + НовыйДокумент;
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

// Процедура возвращает таблицу чеков за кассовую смену.
//
Функция ПолучитьТаблицуЧеков(МассивВидовОпераций)
	
	ТабЧеков = Новый ТаблицаЗначений;
	ТабЧеков.Колонки.Добавить("Чек"       , 	Новый ОписаниеТипов("ДокументСсылка.бит_ЧекККМ"));
	ТабЧеков.Колонки.Добавить("Дата"      , 	ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТабЧеков.Колонки.Добавить("ДатаОплаты", 	ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЧекККМ.Ссылка КАК Чек,
	|	бит_ЧекККМ.Дата КАК Дата,
	|	НАЧАЛОПЕРИОДА(бит_ЧекККМ.Дата, ДЕНЬ) КАК ДатаОплаты
	|ИЗ
	|	Документ.бит_ЧекККМ КАК бит_ЧекККМ
	|ГДЕ
	|	(НЕ бит_ЧекККМ.Архивный)
	|	И (НЕ бит_ЧекККМ.ПометкаУдаления)
	|	И бит_ЧекККМ.Касса = &Касса
	|	И бит_ЧекККМ.Ответственный = &Ответственный
	|	И бит_ЧекККМ.Проведен
	|	И бит_ЧекККМ.ВидОперации В(&МассивВидовОпераций)";
	
	Запрос.УстановитьПараметр("Касса"              , Касса);
	Запрос.УстановитьПараметр("Ответственный"      , мОтветсвенный);
	Запрос.УстановитьПараметр("МассивВидовОпераций", МассивВидовОпераций);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Чек.ЧекПробитНаККМ Тогда
			
			НоваяСтрока = ТабЧеков.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
			
		Иначе
			
			Чек = Выборка.Чек.ПолучитьОбъект();
			Попытка
				
				Чек.УстановитьПометкуУдаления(Истина);
				Чек.Записать(РежимЗаписиДокумента.Запись);
				
			Исключение
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТабЧеков;
	
КонецФункции 

#КонецОбласти

#Область ОператорыОсновнойПрограммы

мОтветсвенный = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнойОтветственный"
										, бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));

#КонецОбласти
